/*
 * 	面向對象 
 */
public class 面向對象 {
/*
 	*面向過程和面向對象
 		
 		面向過程: 主要關注點是: 實現具體過程, 因果關係
 		
 			優點: 對於業務邏輯比較簡單的程序, 可以達到快速開發, 前期投入成本較低
 			
 			缺點: 採用面向過程的方式開發很難解決非常複雜的業務邏輯, 另外面向過程的
 			方式導致軟體元素之間的"耦合度"非常高, 只要其中一環出問題, 整個系統受到影響,
 			導致最終的軟體"擴展力"差, 另外, 由於沒有獨立體,所以無法達到組件復用.
 			
 		面向對象: 主要關注點是: 主要關注對象[獨立體]能完成哪些功能
 			
 			優點: 耦合度低, 擴展力強, 更容易解決現實世界中更複雜的業務邏輯, 組件復用性強
 			
 			缺點: 前期投入成本較高, 需要進行獨立的抽取, 大量的系統分析與設計
 		
 		C語言是純面向過程, C++半面向對象, Java純面向對象
 		
 		現在出現的一些新語言多數都是面向對象, 人在認識現實世界的時候以面向對象的方式
 		
 		面向對象更符合人的思維
 */
}
